#დავალების პირობები
#1)შექმენით ორი განსხვავებული ცვლადი ერთში შეიყვანთ თქვენს სახლეს ხოლო მეორეში თქვენს გვარს შემდენგ კი თითოეული მათგანი დაპრინტეთ შემდეგ კი კომენტარების დახმარებით (#) ახსენით თქვენი დაწერილი კოდი 
#2)შექმენით რამდენიმე ცვლადი სადაც შეინახავთ თქვენს შესახებ ინფორმაციას
#3)გამოიტანეატ ტერმინალში თქვენს შესახებ იფნორმაცის ცვლადების დახმარებით ერთ გრძელ წინადადებად
#4)კომენტარებით ახსენით თუ როგორ ვქმნით ცვლადს და რა არის მისი დანიშნულება
#5)Turtle ბიბლიოთეკის დახმარებით დახატეთ ფასანაურული ხინკალი


name = "luka"
surname = "gabelia"
print(name +" "+ surname)

#პირველად ავიღე ცვლადი name და მივანიჭე "luka"ფუნქცია,შემდეგ კიდევ ავიღე ცვლადი სახელად "suname" და მივანიჭე "gabelia"ფუნქცია,ეს ყველაფერი რომ გამომეტანა ტერმინალში ფამოვიყენე print ფუნქცია და ჩავსი ცვლადები.


name = "luka"
surname = "gabelia"
age = 15
height = 166.5

print(name + " "+ surname + " "+ str(age) +" "+ str(height))

#ცვლადი შეიძლება იყოს ნებისმიერი რამ და ამით ჩვენ მას მივცეთ რაიმე ფუნქცია,რომლის შემდეგ გამოვიტანთ ეკრანზეარ შეიძლება ცვლადი იწყებოდეს რიცხვით.

from turtle import *


speed(30)
width(3)
forward(200)
left(90)
forward(150)
left(90)
forward(70)
right(90)
forward(70)
left(90)
forward(60)
left(90)
forward(70)
right(90)
forward(70)
left(90)
forward(150)

penup()
goto(70,150)
pendown()


left(90)
forward(70)

penup()
goto(100,150)
pendown()

left(90)
forward(70)


penup()
goto(80,100)
pendown()

left(130)
forward(40)
left(140)
forward(40)
left(220)
forward(40)


penup()
goto(150,100)
pendown()

forward(40)
left(140)
forward(40)
left(220)
forward(40)



exitonclick()
